#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
data.terraform_remote_state.database: Reading...
data.terraform_remote_state.infra: Reading...
data.archive_file.lambda_login_artefact: Reading...
data.archive_file.lambda_confirm_user_artefact: Reading...
data.archive_file.lambda_confirm_user_artefact: Read complete after 0s [id=76ea7135b385d32457175c321d56c17f70f63170]
data.terraform_remote_state.database: Read complete after 0s
data.terraform_remote_state.infra: Read complete after 0s
data.archive_file.lambda_login_artefact: Read complete after 0s [id=0df430828407ec6cc6a72f883e046a201ce2e3e2]
data.aws_iam_policy_document.assume_role_lambda: Reading...
data.aws_iam_policy_document.assume_role_lambda: Read complete after 0s [id=2690255455]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_apigatewayv2_api.default will be created
  + resource "aws_apigatewayv2_api" "default" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "fiap-irango-api-gateway"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags                         = {
          + "Name" = "fiap-irango-api-gateway"
        }
      + tags_all                     = {
          + "Environment" = "studying"
          + "Name"        = "fiap-irango-api-gateway"
          + "Service"     = "fiap-irango"
        }

      + cors_configuration {
          + allow_headers = [
              + "Authorization",
              + "Content-Type",
              + "X-Amz-Date",
              + "X-Amz-Security-Token",
              + "X-Api-Key",
            ]
          + allow_methods = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + allow_origins = [
              + "*",
            ]
        }
    }

  # aws_apigatewayv2_integration.default will be created
  + resource "aws_apigatewayv2_integration" "default" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.default will be created
  + resource "aws_apigatewayv2_route" "default" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "GET /login"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_stage.default will be created
  + resource "aws_apigatewayv2_stage" "default" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "fiap-irango-api-gateway-stage"
      + tags          = {
          + "Name" = "fiap-irango-api-gateway-stage"
        }
      + tags_all      = {
          + "Environment" = "studying"
          + "Name"        = "fiap-irango-api-gateway-stage"
          + "Service"     = "fiap-irango"
        }

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + httpMethod              = "$context.httpMethod"
                  + integrationErrorMessage = "$context.integrationErrorMessage"
                  + protocol                = "$context.protocol"
                  + requestId               = "$context.requestId"
                  + requestTime             = "$context.requestTime"
                  + resourcePath            = "$context.resourcePath"
                  + responseLength          = "$context.responseLength"
                  + routeKey                = "$context.routeKey"
                  + sourceIp                = "$context.identity.sourceIp"
                  + status                  = "$context.status"
                }
            )
        }
    }

  # aws_cloudwatch_log_group.api_gateway_log_group will be created
  + resource "aws_cloudwatch_log_group" "api_gateway_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/api_gw/fiap-irango-api-gateway"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "studying"
          + "Service"     = "fiap-irango"
        }
    }

  # aws_cloudwatch_log_group.lambda_confirm_user will be created
  + resource "aws_cloudwatch_log_group" "lambda_confirm_user" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/fiap-irango-lambda-confirm-user"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "studying"
          + "Service"     = "fiap-irango"
        }
    }

  # aws_cloudwatch_log_group.lambda_login will be created
  + resource "aws_cloudwatch_log_group" "lambda_login" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/fiap-irango-lambda-login"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "studying"
          + "Service"     = "fiap-irango"
        }
    }

  # aws_cognito_user.not_identified will be created
  + resource "aws_cognito_user" "not_identified" {
      + attributes            = {
          + "email"          = "no-reply@fiapirango.com"
          + "email_verified" = "true"
        }
      + creation_date         = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + last_modified_date    = (known after apply)
      + mfa_setting_list      = (known after apply)
      + password              = (sensitive value)
      + preferred_mfa_setting = (known after apply)
      + status                = (known after apply)
      + sub                   = (known after apply)
      + user_pool_id          = (known after apply)
      + username              = "no-reply@fiapirango.com"
    }

  # aws_cognito_user_pool.default will be created
  + resource "aws_cognito_user_pool" "default" {
      + arn                        = (known after apply)
      + auto_verified_attributes   = [
          + "email",
        ]
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "fiap-irango-cognito-user-pool"
      + sms_verification_message   = (known after apply)
      + tags                       = {
          + "Name" = "fiap-irango-cognito-user-pool"
        }
      + tags_all                   = {
          + "Environment" = "studying"
          + "Name"        = "fiap-irango-cognito-user-pool"
          + "Service"     = "fiap-irango"
        }
      + username_attributes        = [
          + "email",
        ]

      + lambda_config {
          + pre_sign_up          = (known after apply)
          + pre_token_generation = (known after apply)
        }

      + password_policy {
          + minimum_length    = 11
          + require_lowercase = false
          + require_numbers   = false
          + require_symbols   = false
          + require_uppercase = false
        }

      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "cpf"
          + required                 = false

          + string_attribute_constraints {
              + max_length = "11"
              + min_length = "11"
            }
        }
      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "email"
          + required                 = true

          + string_attribute_constraints {
              + max_length = "256"
              + min_length = "1"
            }
        }

      + username_configuration {
          + case_sensitive = false
        }

      + verification_message_template {
          + default_email_option  = "CONFIRM_WITH_LINK"
          + email_message         = (known after apply)
          + email_message_by_link = (known after apply)
          + email_subject         = (known after apply)
          + email_subject_by_link = (known after apply)
          + sms_message           = (known after apply)
        }
    }

  # aws_cognito_user_pool_client.default will be created
  + resource "aws_cognito_user_pool_client" "default" {
      + access_token_validity                         = (known after apply)
      + allowed_oauth_flows                           = (known after apply)
      + allowed_oauth_flows_user_pool_client          = (known after apply)
      + allowed_oauth_scopes                          = (known after apply)
      + auth_session_validity                         = (known after apply)
      + callback_urls                                 = (known after apply)
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = (known after apply)
      + enable_token_revocation                       = (known after apply)
      + explicit_auth_flows                           = [
          + "ALLOW_ADMIN_USER_PASSWORD_AUTH",
          + "ALLOW_REFRESH_TOKEN_AUTH",
          + "ALLOW_USER_PASSWORD_AUTH",
          + "ALLOW_USER_SRP_AUTH",
        ]
      + generate_secret                               = false
      + id                                            = (known after apply)
      + id_token_validity                             = (known after apply)
      + logout_urls                                   = (known after apply)
      + name                                          = "fiap-irango-cognito-user-pool-client"
      + prevent_user_existence_errors                 = "ENABLED"
      + read_attributes                               = (known after apply)
      + refresh_token_validity                        = 90
      + supported_identity_providers                  = (known after apply)
      + user_pool_id                                  = (known after apply)
      + write_attributes                              = (known after apply)
    }

  # aws_iam_role.lambda_confirm_user will be created
  + resource "aws_iam_role" "lambda_confirm_user" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "fiap-irango-lambda-confirm-user"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "studying"
          + "Service"     = "fiap-irango"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.lambda_login will be created
  + resource "aws_iam_role" "lambda_login" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "fiap-irango-lambda-login"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "studying"
          + "Service"     = "fiap-irango"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaBasicExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "fiap-irango-lambda-login"
    }

  # aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRoleCon will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaBasicExecutionRoleCon" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "fiap-irango-lambda-confirm-user"
    }

  # aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaVPCAccessExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "fiap-irango-lambda-login"
    }

  # aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRoleCon will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaVPCAccessExecutionRoleCon" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "fiap-irango-lambda-confirm-user"
    }

  # aws_lambda_function.confirm_user will be created
  + resource "aws_lambda_function" "confirm_user" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "files/confirm_user_lambda_function_payload.zip"
      + function_name                  = "fiap-irango-lambda-confirm-user"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "pt76IEC2VZnA/N1qji9LSaUtwSPzNJJzpYXZEXmKaVE="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "fiap-irango-lambda-confirm-user"
        }
      + tags_all                       = {
          + "Environment" = "studying"
          + "Name"        = "fiap-irango-lambda-confirm-user"
          + "Service"     = "fiap-irango"
        }
      + timeout                        = 5
      + version                        = (known after apply)

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = (known after apply)
          + subnet_ids                  = [
              + "subnet-02679a330576cd166",
              + "subnet-05feb79ceb951f2ba",
            ]
          + vpc_id                      = (known after apply)
        }
    }

  # aws_lambda_function.login will be created
  + resource "aws_lambda_function" "login" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "files/login_lambda_function_payload.zip"
      + function_name                  = "fiap-irango-lambda-login"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "SHkDQatFrbtHLlMr6r+5tNuIbzgjsE9fvgGui6VTQAI="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "fiap-irango-lambda-login"
        }
      + tags_all                       = {
          + "Environment" = "studying"
          + "Name"        = "fiap-irango-lambda-login"
          + "Service"     = "fiap-irango"
        }
      + timeout                        = 15
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = (known after apply)
          + subnet_ids                  = [
              + "subnet-02679a330576cd166",
              + "subnet-05feb79ceb951f2ba",
            ]
          + vpc_id                      = (known after apply)
        }
    }

  # aws_lambda_permission.cognito_trigger will be created
  + resource "aws_lambda_permission" "cognito_trigger" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "cognito-idp.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromCognito"
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_permission.default will be created
  + resource "aws_lambda_permission" "default" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "fiap-irango-lambda-login"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # aws_security_group.lambda_confirm_user will be created
  + resource "aws_security_group" "lambda_confirm_user" {
      + arn                    = (known after apply)
      + description            = "inbound: all + outbound: all"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "fiap-irango-security-group-lambda-confirm-user"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "fiap-irango-security-group-lambda-confirm-user"
        }
      + tags_all               = {
          + "Environment" = "studying"
          + "Name"        = "fiap-irango-security-group-lambda-confirm-user"
          + "Service"     = "fiap-irango"
        }
      + vpc_id                 = "vpc-0a0b70553073469e2"
    }

  # aws_security_group.lambda_login will be created
  + resource "aws_security_group" "lambda_login" {
      + arn                    = (known after apply)
      + description            = "inbound: all + outbound: all"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "fiap-irango-security-group-lambda-login"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "fiap-irango-security-group-lambda-login"
        }
      + tags_all               = {
          + "Environment" = "studying"
          + "Name"        = "fiap-irango-security-group-lambda-login"
          + "Service"     = "fiap-irango"
        }
      + vpc_id                 = "vpc-0a0b70553073469e2"
    }

Plan: 22 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_api_gateway_url = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>